{"Section_name_28": "Model Details", "Section_Data_28": [{"4_Name of the model:": ""}, {"5_Model type:": ""}, {"6_Owner name/s:": ""}, {"7_Owner contact/s:": ""}, {"8_Where can resources for more information be found?": ""}, {"9_How should the model be cited?": ""}, {"10_License information:": ""}, {"11_How can people give feedback on the model?": ""}, {"36_What is the version date?": ""}], "Section_name_30": "Considerations", "Section_Data_30": [{"12_What are the primary intented uses?": ""}, {"13_What are the primary intented users?": ""}, {"14_Are there any out-of-scope uses?": ""}, {"15_Does the model use any sensitive data (e.g., protected classes)?": ""}, {"16_Is the model intended to inform decision about matters central to human life or flourishing -- e.g., health or safety? Or could it be used in such a way?": ""}, {"17_What risk mitigation strategies were used during model development?": ""}, {"18_What risks may be present in model usage?": ""}, {"19_Are there any known model use cases that are especially fraught?": ""}], "Section_name_31": "Factors", "Section_Data_31": [{"21_What are the foreseeable salient factors for which model performance may vary, and how were these determined?": ""}, {"22_Which factors are being reported, and why were these chosen? If the relevant factors and evaluation factors are different, why?": ""}], "Section_name_32": "Dataset Details", "Section_Data_32": [{"23_What datasets were used to evaluate the model?": ""}, {"24_Why were these datasets chosen?": ""}, {"25_How was the data preprocessed for evaluation (e.g., tokenization of sentences, cropping of images, any filtering such as dropping images without faces)?": ""}], "Section_name_33": "Performance Details", "Section_Data_33": [{"26_What measures of model performance are being reported, and why were they selected over other measures of model performance?": ""}, {"27_If decision thresholds are used, what are they, and why were those decision thresholds chosen?": ""}, {"28_How did the model perform with respect to each factor?": ""}, {"29_How did the model perform with respect to the intersection of evaluated factors?": ""}], "Section_name_34": "Dataset", "Section_Data_34": [{"38_Title": "title"}, {"40_Description": "Description"}, {"41_Size of the dataset:": "700"}, {"44_Split Ratio:": "0.7"}], "Section_name_35": "Quantitative Analysis", "Section_Data_35": [{"31_Select the metrics you want to include": "{\"selected metrics\": [[\"0.1\"], [\"0.01\"], [\"0.1\"]]}"}], "Section_name_36": "Caveats and Recommendations", "Section_Data_36": [{"32_Did the results suggest and further testing?": ""}, {"33_Were there any relevant groups that were not represented in the evaluation dataset?": ""}, {"34_Are there additional recommendations for model use?": ""}, {"35_What are the ideal characteristics of an evaluation dataset for this model?": ""}]}