{"Section_name_28": "Model Details", "Section_Data_28": [{"4_Name of the model:": "Smiling Detection in Images"}, {"5_Model type:": "Convolutional Neural Net\r\nPretrained for face recognition then fine-tuned with cross-entropy loss for binary\r\nsmiling classification."}, {"6_Owner name/s:": "Researchers at Google and the University of Toronto"}, {"7_Owner contact/s:": "research@google.com"}, {"8_Where can resources for more information be found?": "www.moreresource.com"}, {"9_How should the model be cited?": "Style, citation"}, {"10_License infromation": "MIT License"}, {"11_How can people give feedback on the model?": "feedback@google.com"}, {"36_What is the version date?": "2023-06-18"}], "Section_name_30": "Considerations", "Section_Data_30": [{"12_What are the primary intented uses?": "Intended to be used for fun applications, such as creating cartoon smiles on real\r\nimages; augmentative applications, such as providing details for people who are\r\nblind; or assisting applications such as automatically finding smiling photos.\r\n"}, {"13_What are the primary intented users?": "Not suitable for emotion detection or determining affect; smiles were annotated\r\nbased on physical appearance, and not underlying emotions."}, {"14_Are there any out-of-scope uses?": "Not suitable for emotion detection or determining affect; smiles were annotated\r\nbased on physical appearance, and not underlying emotions."}, {"15_Does the model use any sensitive data (e.g., protected classes)?": ""}, {"16_Is the model intednded to inform decision about matters central to human life or flourishing -- e.g., health or safety? Or could it be used in such a way?": ""}, {"17_What risk mitigation strategies were used during model development?": ""}, {"18_What risks may be present in model usage?": ""}, {"19_Are there any known model use cases that are especially fraught?": ""}], "Section_name_31": "Factors", "Section_Data_31": [{"21_What are the foreseeable salient factors for which model performance may vary, and how were these determined?": "ased on known problems with computer vision face technology, potential rel\u0002evant factors include groups for gender, age, race, and Fitzpatrick skin type;\r\nhardware factors of camera type and lens type; and environmental factors of\r\nlighting and humidity."}, {"22_Which factors are being reported, and why were these chosen? If the relevant factors and evaluation factors are different, why?": " Evaluation factors are gender and age group, as annotated in the publicly available\r\ndataset CelebA [36]. Further possible factors not currently available in a public\r\nsmiling dataset. Gender and age determined by third-party annotators based\r\non visual presentation, following a set of examples of male/female gender and\r\nyoung/old age. Further details available in [36].\r\n"}], "Section_name_32": "Dataset Details", "Section_Data_32": [{"23_What datasets were used to evaluate the model?": "CelebA "}, {"24_Why were these datasets chosen?": "Chosen as a basic proof-of-concept."}, {"25_How was the data preprocessed for evaluation (e.g., tokenization of sentences, cropping of images, any filtering such as dropping images without faces)?": ""}], "Section_name_33": "Performance Details", "Section_Data_33": [{"26_What measures of model performance are being reported, and why were they selected over other measures of model performance?": "Evaluation metrics include False Positive Rate and False Negative Rate to\r\nmeasure disproportionate model performance errors across subgroups. False\r\nDiscovery Rate and False Omission Rate, which measure the fraction of nega\u0002tive (not smiling) and positive (smiling) predictions that are incorrectly predicted\r\nto be positive and negative, respectively, are also reported."}, {"27_If decision thresholds are used, what are they, and why were those decision thresholds chosen?": "All metrics reported at the .5 decision threshold, where all error types (FPR, FNR,\r\nFDR, FOR) are within the same range (0.04 - 0.14)."}, {"28_How did the model perform with respect to each factor?": ""}, {"29_How did the model perform with respect to the intersection of evaluated factors?": ""}], "Section_name_36": "Caveats and Recommendations", "Section_Data_36": [{"32_Did the results suggest and further testing?": "Does not capture race or skin type, which has been reported as a source of disproportionate errors [5]"}, {"33_Were there any relevant groups that were not represented in the evaluation dataset?": "Given gender classes are binary (male/not male), which we include as male/female. Further work needed to evaluate across a\r\nspectrum of genders."}, {"34_Are there additional recommendations for model use?": " An ideal evaluation dataset would additionally include annotations for Fitzpatrick skin type, camera details, and environment\r\n(lighting/humidity) details."}, {"35_What are the ideal characteristics of an evaluation dataset for this model?": ""}]}